tests/data/wrk2_output_all_error.txt
Running 45s test @ https://www.google.com/this-should-be-a-404
  1 threads and 2 connections
  Thread calibration: mean lat.: 1.901ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.82ms    1.06ms  19.34ms   98.28%
    Req/Sec    10.22     38.61   222.00     92.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.76ms
 75.000%    2.03ms
 90.000%    2.38ms
 99.000%    3.17ms
 99.900%   19.36ms
 99.990%   19.36ms
 99.999%   19.36ms
100.000%   19.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.903     0.000000            1         1.00
       1.160     0.100000           35         1.11
       1.318     0.200000           70         1.25
       1.467     0.300000          105         1.43
       1.634     0.400000          141         1.67
       1.758     0.500000          174         2.00
       1.806     0.550000          192         2.22
       1.858     0.600000          209         2.50
       1.914     0.650000          227         2.86
       1.987     0.700000          244         3.33
       2.034     0.750000          261         4.00
       2.121     0.775000          270         4.44
       2.163     0.800000          279         5.00
       2.243     0.825000          288         5.71
       2.291     0.850000          296         6.67
       2.327     0.875000          305         8.00
       2.345     0.887500          309         8.89
       2.379     0.900000          314        10.00
       2.409     0.912500          318        11.43
       2.435     0.925000          322        13.33
       2.485     0.937500          327        16.00
       2.497     0.943750          329        17.78
       2.501     0.950000          331        20.00
       2.559     0.956250          334        22.86
       2.563     0.962500          335        26.67
       2.597     0.968750          338        32.00
       2.613     0.971875          339        35.56
       2.617     0.975000          341        40.00
       2.617     0.978125          341        45.71
       2.637     0.981250          342        53.33
       2.969     0.984375          343        64.00
       3.003     0.985938          344        71.11
       3.003     0.987500          344        80.00
       3.169     0.989062          345        91.43
       3.169     0.990625          345       106.67
       3.457     0.992188          346       128.00
       3.457     0.992969          346       142.22
       3.457     0.993750          346       160.00
       5.103     0.994531          347       182.86
       5.103     0.995313          347       213.33
       5.103     0.996094          347       256.00
       5.103     0.996484          347       284.44
       5.103     0.996875          347       320.00
      19.359     0.997266          348       365.71
      19.359     1.000000          348          inf
#[Mean    =        1.816, StdDeviation   =        1.060]
#[Max     =       19.344, Total count    =          348]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  451 requests in 45.00s, 183.22KB read
  Non-2xx or 3xx responses: 451
Requests/sec:     10.02
Transfer/sec:      4.07KB