tests/data/wrk2_output_errors.txt
Running 1m test @ https://www.google.com
  1 threads and 2 connections
  Thread calibration: mean lat.: 58.492ms, rate sampling interval: 127ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.33ms   24.98ms 244.10ms   96.20%
    Req/Sec     9.49      6.99    23.00     66.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   53.31ms
 75.000%   56.99ms
 90.000%   62.62ms
 99.000%  223.23ms
 99.900%  244.22ms
 99.990%  244.22ms
 99.999%  244.22ms
100.000%  244.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      44.223     0.000000            1         1.00
      48.671     0.100000           50         1.11
      49.855     0.200000          101         1.25
      51.167     0.300000          151         1.43
      52.255     0.400000          201         1.67
      53.311     0.500000          250         2.00
      53.983     0.550000          275         2.22
      54.463     0.600000          300         2.50
      55.231     0.650000          325         2.86
      55.967     0.700000          350         3.33
      56.991     0.750000          375         4.00
      57.855     0.775000          388         4.44
      58.399     0.800000          401         5.00
      59.007     0.825000          413         5.71
      59.679     0.850000          425         6.67
      60.799     0.875000          438         8.00
      61.407     0.887500          444         8.89
      62.623     0.900000          450        10.00
      63.871     0.912500          457        11.43
      64.863     0.925000          463        13.33
      68.287     0.937500          469        16.00
      69.183     0.943750          472        17.78
      72.127     0.950000          475        20.00
      81.471     0.956250          479        22.86
      85.247     0.962500          482        26.67
      94.015     0.968750          485        32.00
      95.999     0.971875          486        35.56
     126.911     0.975000          488        40.00
     162.303     0.978125          490        45.71
     177.919     0.981250          491        53.33
     194.047     0.984375          493        64.00
     194.047     0.985938          493        71.11
     212.607     0.987500          494        80.00
     223.231     0.989062          495        91.43
     230.911     0.990625          496       106.67
     231.807     0.992188          497       128.00
     231.807     0.992969          497       142.22
     231.807     0.993750          497       160.00
     237.055     0.994531          498       182.86
     237.055     0.995313          498       213.33
     239.615     0.996094          499       256.00
     239.615     0.996484          499       284.44
     239.615     0.996875          499       320.00
     239.615     0.997266          499       365.71
     239.615     0.997656          499       426.67
     244.223     0.998047          500       512.00
     244.223     1.000000          500          inf
#[Mean    =       58.326, StdDeviation   =       24.976]
#[Max     =      244.096, Total count    =          500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  600 requests in 1.00m, 112.39MB read
  Non-2xx or 3xx responses: 14
Requests/sec:     10.00
Transfer/sec:      1.87MB