tests/data/ycsb-test-run-5.dat
[OVERALL], RunTime(ms), 29770.0
[OVERALL], Throughput(ops/sec), 33590.86328518643
[READ], Operations, 100
[READ], AverageLatency(us), 7030.9258255978775
[READ], MinLatency(us), 2110
[READ], MaxLatency(us), 988159
[READ], 95thPercentileLatency(us), 22735
[READ], 99thPercentileLatency(us), 49311
[READ], Return=OK, 4
[READ], Return=ERROR, 96
[INSERT], Operations, 100
[INSERT], AverageLatency(us), 7030.9258255978775
[INSERT], MinLatency(us), 2110
[INSERT], MaxLatency(us), 988159
[INSERT], 95thPercentileLatency(us), 22735
[INSERT], 99thPercentileLatency(us), 49311
[INSERT], Return=OK, 50
[INSERT], Return=ERROR, 50
[UPDATE], Operations, 100
[UPDATE], AverageLatency(us), 7030.9258255978775
[UPDATE], MinLatency(us), 2110
[UPDATE], MaxLatency(us), 988159
[UPDATE], 95thPercentileLatency(us), 22735
[UPDATE], 99thPercentileLatency(us), 49311
[UPDATE], Return=OK, 50
[UPDATE], Return=ERROR, 50